Repository: tbuquet/csharp_replicastudio
Catalog: ReplicaStudio.Editor/Forms/EventActions.*.resx
Languages: fr

# grpTime.Text
source: Time
fr: Temps

# btnScriptWait.Text
source: Wait
fr: Attendre

# btnScriptRandom.Text
source: Random
fr: Valeur Aléatoire

# btnScriptInsertComment.Text
source: Insert a comment
fr: Insérer un commentaire

# btnScriptGoToAnchor.Text
source: Go to anchor
fr: Aller à l'ancre

# btnScriptSetAnchor.Text
source: Set anchor
fr: Mettre une ancre

# btnScriptCallGlobalEvent.Text
source: Call global event
fr: Appeler un évènement global

# btnScriptBreakLoop.Text
source: Break the loop
fr: Quitter la boucle

# btnScriptLoop.Text
source: Loop
fr: Boucle

# btnScriptChangeVariable.Text
source: Change variable
fr: Changer variable

# btnScriptChangeSwitch.Text
source: Press switch
fr: Appuyer sur Bouton

# tabPlayer.Text
source: Player
fr: Joueur

# grpRendering.Text
source: Rendering
fr: Rendu

# btnScriptFreePlayerAnimations.Text
source: Free animations
fr: Libérer animations

# btnScriptFreezePlayerAnimations.Text
source: Freeze animations
fr: Geler animations

# btnScriptChangePlayerSpeed.Text
source: Change speed
fr: Changer vitesse

# btnScriptChangePlayerAnimation.Text
source: Change animation
fr: Changer animation

# grpCommands.Text
source: Commands
fr: Commandes

# btnScriptRemoveItem.Text
source: Remove an item
fr: Retirer un objet

# btnScriptAddItem.Text
source: Add an item
fr: Ajouter un objet

# chgAddPlayerAction.Text
source: Add player action
fr: Ajouter action joueur

# RemovePlayerAction.Text
source: Remove player action
fr: Retirer action joueur

# grpLife.Text
source: Life
fr: Vie

# btnScriptChangeMaxHP.Text
source: Change max HP
fr: Changer PV Max

# btnScriptChangeHP.Text
source: Change HP
fr: Changer PV

# grpDialogs.Text
source: Dialogs
fr: Dialogues

# btnScriptChoiceMessages.Text
source: Show choices
fr: Montrer choix

# btnScriptMessage.Text
source: Show messages
fr: Montrer messages

# grpPlayer.Text
source: Current Player
fr: Joueur courant

# btnChangePlayerDirection.Text
source: Change player direction
fr: Changer direction du joueur

# btnScriptShowCurrentPlayer.Text
source: Show player
fr: Montrer joueur

# btnScriptHideCurrentPlayer.Text
source: Hide player
fr: Cacher joueur

# StopCurrentPlayerMovement.Text
source: Stop player movement
fr: Stopper déplacement joueur

# btnScriptMovePlayer.Text
source: Move player
fr: Déplacer joueur

# btnScriptTeleport.Text
source: Teleport
fr: Téléporter

# btnScriptChangeCharacter.Text
source: Change current character
fr: Changer le personnage courant

# tabStage.Text
source: Stage
fr: Scène

# grpCamera.Text
source: Camera
fr: Caméra

# btnScriptDefaultCamera.Text
source: Default camera
fr: Caméra par défaut

# btnScriptFocusOnAnimation.Text
source: Focus on animation
fr: Centrer sur animation

# btnScriptFocusOnCharacter.Text
source: Focus on character
fr: Centrer sur personnage

# btnScriptMoveCamera.Text
source: Move camera
fr: Déplacer Caméra

# grpNPC.Text
source: NPC
fr: PNJ

# btnLookForwardPlayer.Text
source: Look forward player
fr: Regarder en direction du joueur

# btnScriptMoveCharacter.Text
source: Move character
fr: Déplacer personnage

# chgCharacterDirection.Text
source: Change character direction
fr: Changer direction personnage

# btnScriptChangeCharacterFrequency.Text
source: Change animation frequency
fr: Changer fréquence d'animation

# StopCharacterMovement.Text
source: Stop character movement
fr: Stop déplacement personnage

# btnScriptFreezeCharacter.Text
source: Freeze character animation
fr: Geler animation personnage

# btnScriptFreeCharacter.Text
source: Free character animation
fr: Libérer animation personnage

# btnScriptChangeCurrentAction.Text
source: Change current action
fr: Change action courante

# btnScriptEnableUserControls.Text
source: Enable user controls
fr: Activer contrôles utilisateur

# btnScriptDisableUserControls.Text
source: Disable user controls
fr: Désactiver contrôles utilisateur

# btnScriptEnableStageInteractions.Text
source: Enable stage interactions
fr: Activer interactions scène

# btnScriptDisableStageInteractions.Text
source: Disable stage interactions
fr: Désactiver interactions scène

# btnScriptShowLifeBar.Text
source: Show life bar
fr: Montrer la barre de vie

# btnScriptHideLifeBar.Text
source: Hide the life bar
fr: Cacher la barre de vie

# btnScriptEnableSaves.Text
source: Enable saves
fr: Activer sauvegardes

# btnScriptDisableSaves.Text
source: Disable saves
fr: Désactiver sauvegardes

# btnScriptGameOver.Text
source: Game Over
fr: Fin du jeu

# btnScriptLoadGame.Text
source: Load the game
fr: Charger le jeu

# btnScriptSaveGame.Text
source: Save the game
fr: Sauvegarder le jeu

# btnScriptCloseInventory.Text
source: Close inventory
fr: Fermer l'inventaire

# btnScriptOpenInventory.Text
source: Open inventory
fr: Ouvrir l'inventaire

# btnScriptGoToTitleScreen.Text
source: Title screen
fr: Ecran titre

# grpSounds.Text
source: Sounds
fr: Sons

# btnScriptStopSound.Text
source: Stop sound
fr: Stopper son

# btnScriptPlaySound.Text
source: Play sound
fr: Jouer son

# grpMusics.Text
source: Musics
fr: Musiques

# btnScriptChangeMusicFrequency.Text
source: Change music frequency
fr: Changer fréquence musique

# btnScriptStopMusic.Text
source: Stop music
fr: Stopper musique

# btnScriptPlayMusic.Text
source: Play music
fr: Jouer musique

# $this.Text
source: Event Actions
fr: Actions de l'évènement
