Repository: tbuquet/csharp_replicastudio
Catalog: ReplicaStudio.Editor/Forms/GeneralSettings.*.resx
Languages: fr

# btnCancel.Text
source: Cancel
fr: Annuler

# btnChooseViewerPath.Text
source: Choose
fr: Parcourir

# btnChooseGameFolder.Text
source: Choose
fr: Parcourir

# lblViewerPath.Text
source: Viewer path :
fr: Chemin du viewer :

# lblGameFolder.Text
source: Game folder :
fr: Dossier Jeux :

# grpPath.Text
source: Paths
fr: Chemins

# lblTransparentBlockSize.Text
source: Transparent bloc size :
fr: Taille des blocs transprents :

# lblTransparentBlockColor2.Text
source: Transparent bloc color 2 :
fr: Bloc transparent couleur 2 :

# lblTransparentBlockColor1.Text
source: Transparent bloc color 1 :
fr: Bloc transparent couleur 1 :

# grpBackgrounds.Text
source: Backgrounds
fr: Ecran de fond

# label1.Text
source: Message font size :
fr: Taille de police des messages :

# lblMessageDuration.Text
source: Message duration :
fr: Durée des messages :

# lblVectorPointsSize.Text
source: Coords Points size :
fr: Taille des points de coordonnées :

# lblStagePadding.Text
source: Stage padding :
fr: Espacement scène :

# lblShowAnimationsWhileMasking.Text
source: Always show animations :
fr: Toujours montrer les animations :

# lblShowCharactersWhileMasking.Text
source: Always show characters :
fr: Toujours montrer les personnages :

# lblActivateZoomWithWheel.Text
source: Activate zoom with wheel :
fr: Activer le zoom avec la molette :

# lblSelectedHotSpotColor.Text
source: Selected HotSpot color in Coords Selector :
fr: Couleur des HotSpot sur la scène :

# lblSelectionCoords.Text
source: Selected coords color in stage :
fr: Couleur de pointage du Gestionnaire de Coordoonnées

# lblHighlightningBrush.Text
source: Highlightning color in Animation Manager :
fr: Couleur de surbrillance dans le Gestionnaire d'Animation :

# lblHighlightningColor.Text
source: Highlightning color for selection in stage :
fr: Couleur de surbrillance pour les sélection sur la scène :

# grpStages.Text
source: Stages
fr: Scènes

# lblAnimationDefaultFrequency.Text
source: Animation default frequency :
fr: Fréquence d'animation par défaut :

# groupBox1.Text
source: Backgrounds
fr: Ecran de fond

# $this.Text
source: GeneralSettings
fr: Paramètres généraux
