Repository: tbuquet/csharp_replicastudio
Catalog: ReplicaStudio.Editor/Culture/Language/EditorConstants.*.resx
Languages: fr

# EVENTMANAGER_NO_CLASSES
source: None
fr: Aucune

source: Export Success !
fr: Export réussi !

# MOV_DOWN
source: Down
fr: Bas

# MOV_LEFT
source: Left
fr: Gauche

# MOV_LEFTDOWN
source: Left-Down
fr: Gauche-Bas

# MOV_RIGHT
source: Right
fr: Droite

# MOV_RIGHTDOWN
source: Right-Down
fr: Droite-Bas

# MOV_UP
source: Up
fr: Haut

# MOV_UPLEFT
source: Up-Left
fr: Haut-Gauche

# MOV_UPRIGHT
source: Up-Right
fr: Haut-Droite

# PROJECTPANEL_CHARACTERS
source: Characters
fr: Personnages

# PROJECTPANEL_DECORS
source: Decors
fr: Décors

# PROJECTPANEL_MUSICS
source: Musics
fr: Musiques

# PROJECTPANEL_STAGES
source: Stages
fr: Scènes

# STAGEOBJECTSPANEL_CHARACTERS
source: Characters
fr: Personnages

# STAGEOBJECTSPANEL_DECORS
source: Decors
fr: Décors

# STAGEOBJECTSPANEL_REGIONS
source: Regions
fr: Régions

# STAGEOBJECTSPANEL_WALKABLE
source: Walkable areas
fr: Zones de déplacements

# STATUS_DESC_ABOUT
source: Expand a submenu which propose help or information about the soft.
fr: Développe un sous-menu qui propose de l'aide ou des informations à propos du logiciel.

# STATUS_DESC_ABOUTUS
source: Open a popup that gives information about the dev team.
fr: Ouvre une boite de dialogue qui donne des informations à propos de l'équipe de développement.

# STATUS_DESC_BUILD
source: Expand a submenu which propose to export the project to different locations. Currently only Windows OS are supported.
fr: Développe un sous-menu qui propose d'exporter le projet sur différents supports. Actuellement, seul les systèmes d'exploitation Windows sont supportés.

# STATUS_DESC_BUILDTOWINDOWS
source: Expand a submenu which propose to try the game either in a normal mode or a fullscreen mode.
fr: Développe un sous-menu qui propose d'essayer le jeu soit en mode fenêtré, soit en mode plein écran.

# STATUS_DESC_CIRCLE
source: Use the circle tool to draw circles for hidden events or walkable areas.
fr: Utilisez l'outil cercle pour dessiner des cercles pour évènements cachés ou zones de déplacement.

# STATUS_DESC_COPY
source: Copy an object and keep it in memory to be pasted later.
fr: Copie un objet et le garde en mémoire pour être collé plus tard.

# STATUS_DESC_CREATEMAP
source: Open a popup to create a new map.
fr: Ouvre une boite de dialogue pour créer une nouvelle scène.

# STATUS_DESC_CUT
source: Delete an object and keep it in memory to be pasted later.
fr: Supprime un objet et le garde en mémoire pour être collé plus tard.

# STATUS_DESC_DATABASE
source: Open the database window, which allow you to modify all the game system resources.
fr: Ouvre la fenêtre de la Base de données, pour vous permettre de modifier toute les ressources systèmes du jeu.

# STATUS_DESC_DELETE
source: Delete an object.
fr: Supprime un objet.

# STATUS_DESC_DOCUMENT
source: Open a documentation to help to get started with the soft.
fr: Ouvre une documentation d'aide pour commencer à développer avec le logiciel.

# STATUS_DESC_DRAWING
source: Expand a submenu to choose a tool to draw an hidden event or walkable areas.
fr: Développe un sous-menu pour choisir un outil pour dessiner un évènement caché ou une zone de déplacement.

# STATUS_DESC_EDITION
source: Expand a submenu to do the cut/copy/paste operations.
fr: Développe un sous-menu pour faire des opérations de couper/copier/coller.

# STATUS_DESC_EXIT
source: Leave the application.
fr: Quitte l'application.

# STATUS_DESC_FILE
source: Expand a submenu to manage a project, access to the general settings or leave the application.
fr: Développe un sous-menu pour gérer un projet, accéder aux paramètres généraux ou quitter l'application.

# STATUS_DESC_FULLSCREEN_TRY
source: Compile the game and launch it in a fullscreen mode.
fr: Compile le jeu et le lance en mode plein écran.

# STATUS_DESC_GAME
source: Expand a submenu which propose to try the game either in a normal mode or a fullscreen mode.
fr: Développe un sous-menu qui propose d'essayer le jeu soit en mode fenêtré, soit en mode plein écran.

# STATUS_DESC_GENERALSETTINGS
source: Open a popup to change some general settings of the application.
fr: Ouvre une boite de dialogue pour changer les paramètres généraux de l'application.

# STATUS_DESC_IMPORTMASK
source: Open a popup to choose a mask file to import within the current stage.
fr: Ouvre une boite de dialogue pour choisir un fichier masque à importer dans la scène courante.

# STATUS_DESC_INFOPANEL
source: Provide informations about the selected object within the stage, or the stage itself if nothing is selected.
fr: Donne des informations à propos de l'objet sélectionné sur la scène, ou la scène elle même si rien n'est sélectionné.

# STATUS_DESC_LANGUAGE
source: Expand a submenu which propose to change the language
fr: Développe un sous-menu permettant le choix de la langue

# STATUS_DESC_LAYERSPANEL
source: Allow you to create, edit or delete layers for the stage.
fr: Permet de créer, modifier ou supprimer des calques pour la scène.

# STATUS_DESC_LOAD
source: Load a project and all its stages.
fr: Charge un projet et toute ses scènes.

# STATUS_DESC_MODE
source: Expand a submenu to choose the edition mode for the stage.
fr: Développe un sous-menu pour choisir le mode d'édition de la scène.

# STATUS_DESC_MODE_CHARACTERS
source: Change the edition mode for the stage to Characters, which allow you to place character objects. Hidden events and areas are not shown.
fr: Change le mode d'édition de la scène en mode personnages, qui vous permet de placer des objets personnage. Les évènements cachés et zones ne sont pas montré.

# STATUS_DESC_MODE_DECORS
source: Change the edition mode for the stage to Decors, which allow you to place decors. Objects, hidden events and areas are not shown.
fr: Change le mode d'édition de la scène en mode décors, qui vous permet de placer des décors. Les objets, évènements cachés et zones ne sont pas montré.

# STATUS_DESC_MODE_EVENTS
source: Change the edition mode for the stage to Events, which allow you to place hidden events. Walkable areas and regions are not shown.
fr: Change le mode d'édition de la scène en mode évènements, qui vous permet de placer des évènements cachés. Les zones de déplacement et régions ne sont pas montré.

# STATUS_DESC_MODE_OBJECTS
source: Change the edition mode for the stage to Objects, which allow you to place animation objects. Hidden events and areas are not shown.
fr: Change le mode d'édition de la scène en mode objets, qui vous permet de placer des objets animés. Les évènements cachés et zones ne sont pas montré.

# STATUS_DESC_MODE_REGIONS
source: Change the edition mode for the stage to Regions, which allow you to create new areas and set percentage of zoom on characters sprites depending on how far they are from the main region (zoom 100%). Hidden events and walkable areas are not shown.
fr: Change le mode d'édition de la scène en mode régions, qui vous permet de définir des zones précisant le pourcentage de zoom des personnages, selon leur distance par rapport à la zone principale (Zoom 100%). Les évènements cachés et zones de déplacement ne sont pas montré.

# STATUS_DESC_MODE_WALKABLE
source: Change the edition mode for the stage to Walkable Areas, which allow you to specify where the player character can/can't move. Hidden events and regions are not shown.
fr: Change le mode d'édition de la scène en mode zone de déplacement, qui vous permet de définir où le joueur peut/ne peut pas se déplacer. Les évènements cachés et régions ne sont pas montré.

# STATUS_DESC_NEW
source: Open a popup to create a new project.
fr: Ouvre une boite de dialogue pour créer un nouveau projet.

# STATUS_DESC_PASTE
source: Paste an object that has been kept in memory by a cut/copy action.
fr: Colle un objet qui a été gardé en mémoire par une action de couper/copier.

# STATUS_DESC_PENCIL
source: Use the pencil tool to draw areas for hidden events or walkable areas.
fr: Utilisez le crayon pour dessiner des zones pour des évènements cachés ou des zones de déplacement.

# STATUS_DESC_POINTER
source: Use the pointer tool to select pointers made by the pencil, rectangle or circle tool for hidden events or walkable areas.
fr: Utilisez l'outil pointeur pour sélectionner des zones d'évènements caché ou zones de déplacement créés par l'outil crayon, rectangle ou cercle.

# STATUS_DESC_PREVIEWPANEL
source: Provide a preview of the selected objet in the stage.
fr: Fourni un aperçu de l'objet sélectionné sur la scène.

# STATUS_DESC_PROJECTPANEL
source: Allows you to drag & drop objects to the stage. It also lists all the stage that can be loaded with a double click on a stage name.
fr: Permet de Glisser/Déposer des objets sur la scène. Il liste aussi toute les scènes pouvant être chargé avec un double click sur un nom de la scène.

# STATUS_DESC_RECTANGLE
source: Use the rectangle tool to draw rectangles for hidden events or walkable areas.
fr: Utilisez l'outil rectangle pour dessiner des rectangles pour évènements cachés ou zones de déplacement.

# STATUS_DESC_RESOURCES
source: Expand a submenu which propose to create a map or access to the Database or the Resources Manager.
fr: Développe un sous-menu qui propose la création d'une scène ou d'accéder à la Base de données ou le Gestionnaire de Ressources.

# STATUS_DESC_RESOURCESMANAGER
source: Open the Resources Manager window, which allow you to import, preview or delete physical resources such as pictures or musics.
fr: Ouvre la fenêtre du Gestionnaire de Ressources, pour vous permettre d'importer, prévisualiser ou supprimer les ressources physiques, comme des images ou des musiques.

# STATUS_DESC_SAVE
source: Save a project and all its stages.
fr: Sauvegarde un projet et toute ses scènes.

# STATUS_DESC_SPRITECREATOR
source: Launch the external tool "Sprite Creator" which help creating character animations
fr: Ouvre le programme externe "Sprite Creator" qui aide à créer des animations de personnage

# STATUS_DESC_STAGE
source: Allows you to manage objects within the stage or add events in it.
fr: Permet de gérer les objets sur la scène ou ajouter des évènement dessus.

# STATUS_DESC_STAGEOBJECTSPANEL
source: Provide you a view of all objects in the stage.
fr: Fourni une vue de tout les objets sur la scène.

# STATUS_DESC_TRY
source: Compile the game and launch it in a windowed mode.
fr: Compile le jeu et le lance en mode fenêtré.

# STATUS_DESC_VIEW
source: Expand a submenu to manage the windows settings of the application.
fr: Développe un sous-menu pour gérer les paramètres de fenêtrage de l'application.

# STATUS_DESC_VIEW_LEFT_BAR
source: Show/Hide the toolbar on the left.
fr: Montrer/Cacher la barre d'outil de gauche.

# STATUS_DESC_VIEW_RIGHT_BAR
source: Show/Hide the toolbar on the right.
fr: Montrer/Cacher la barre d'outil de droite.

# STATUS_DESC_VIEW_TOOLBAR
source: Show/Hide the toolbar in the menu.
fr: Montrer/Cacher la barre d'outil dans le menu.

# STATUS_DESC_WEBSITE
source: Open the website of Replica Studio.
fr: Ouvre le site web de Replica Studio

# STATUS_DESC_ZOOM
source: Expand a submenu to choose a zoom to apply to the stage edition.
fr: Développe un sous-menu pour choisir le zoom à appliquer sur l'édition de la scène.

# STATUS_DESC_ZOOM11
source: Apply a zoom of 100% to the stage edition.
fr: Applique un zoom de 100% à l'édition de la scène.

# STATUS_DESC_ZOOM12
source: Apply a zoom of 200% to the stage edition.
fr: Applique un zoom de 200% à l'édition de la scène.

# STATUS_DESC_ZOOM14
source: Apply a zoom of 400% to the stage edition.
fr: Applique un zoom de 400% à l'édition de la scène.

# STATUS_DESC_ZOOM18
source: Apply a zoom of 800% to the stage edition.
fr: Applique un zoom de 800% à l'édition de la scène.

# TERM_CHOICENEXT
source: Next
fr: Suivant

# TERM_CHOICEPREVIOUS
source: Previous
fr: Précédent

# TERM_LEAVEGAME
source: Leave Game
fr: Quitter le jeu

# TERM_LOADGAME
source: Load Game
fr: Charger une partie

# TERM_NEWGAME
source: New Game
fr: Nouvelle partie

# TERM_RETURNTITLE
source: Return to title screen
fr: Revenir à l'écran titre

# TERM_SAVEGAME
source: Save Game
fr: Sauvegarder la partie

# TERM_SAVESTATE
source: Save State
fr: Etat de sauvegarde
